public class DisplayList {
    public static void main(String[] args) {
        String[] bookNames = {
                "李尔王",
                "麦克白",
                "哈姆雷特",
                "奥赛罗",
                "罗密欧与朱丽叶",
                "威尼斯商人",
                "傲慢与偏见",
                "简·爱",
                "呼啸山庄",
                "雾都孤儿",
                "大卫·科波菲尔",
                "双城记",
                "远大前程",
                "荒凉山庄",
                "爱丽丝梦游仙境",
                "格列佛游记",
                "金银岛",
                "化身博士",
                "福尔摩斯探案集",
                "三个火枪手",
                "悲惨世界",
                "巴黎圣母院",
                "红与黑",
                "局外人",
                "鼠疫",
                "百年孤独",
                "霍乱时期的爱情",
                "没有人给他写信的上校",
                "安娜·卡列尼娜",
                "战争与和平",
                "罪与罚",
                "卡拉马佐夫兄弟",
                "死魂灵",
                "静静的顿河",
                "日瓦戈医生",
                "飘",
                "了不起的盖茨比",
                "老人与海",
                "动物农场",
                "一九八四",
                "美丽新世界",
                "简爱",
                "呼啸山庄",
                "雾都孤儿",
                "大卫·科波菲尔",
                "安娜·卡列尼娜",
                "百年孤独",
                "霍乱时期的爱情",
                "没有人给他写信的上校",
                "飘",
                "了不起的盖茨比",
                "老人与海",
                "动物农场",
                "一九八四",
                "美丽新世界",
                "追风筝的人",
                "杀死一只知更鸟",
                "东方快车谋杀案",
                "小王子",
                "乌合之众"
        };

        int bookIndex = 0;
        do {
            System.out.print(bookNames[bookIndex] + " ");
            if (bookIndex % 10 == 9) {
                System.out.print("\n");
            }
            bookIndex++;
        } while (bookIndex < 50);
    }
}
